{
  "blueprint_variables": [
    ["Variable Name", "Variable Description"],
    [
      "`name`",
      "This should be the official name for the product that the role installs/configures. It is used in the title of the README and throughout the documentation to refer to the product."
    ],
    [
      "`overview`",
      "This variable should be a description of what the role installs. You can usually find a good description by Googling, \"What is Android Studio,\" for example if you were populating this variable for the [Android Studio role]({{ repository.group.ansible_roles }}/androidstudio). This text is shown at the top of the README, right below the header section and before the table of contents. Whenever possible, key products/terms should be linked to using markdown. You can see an example of us hyperlinking in this variable by checking out the [Android Studio role]({{ repository.group.ansible_roles }}/androidstudio). The idea is to make it as easy as possible for our users to figure out exactly what the role does."
    ]
  ],
  "github_prefix": "ansible-",
  "group": "ansible",
  "header_description_pre": "An Ansible project brought to you by ",
  "molecule_descriptions": [
    ["Scenario", "Description"],
    ["`default`", "Tests on all platforms using VirtualBox (RAM intensive)"],
    ["`docker`", "Tests on all Linux platforms using Docker"],
    [
      "`docker-snap`",
      "Same as the `docker` scenario except it excludes platforms that have trouble installing snap packages on Docker"
    ],
    ["`archlinux-desktop`", "Tests using the latest version of Archlinux desktop using VirtualBox"],
    ["`centos-desktop`", "Tests using the latest version of CentOS desktop using VirtualBox"],
    ["`debian-desktop`", "Tests using the latest version of Debian desktop using VirtualBox"],
    ["`fedora-desktop`", "Tests using the latest version of Fedora desktop using VirtualBox"],
    ["`macos-desktop`", "Tests using the latest version of macOS desktop using VirtualBox"],
    ["`ubuntu-desktop`", "Tests using the latest version of Ubuntu desktop using VirtualBox"],
    ["`windows-desktop`", "Tests using the latest version of Windows desktop using VirtualBox"],
    ["`ci-docker-archlinux`", "Uses Docker to test Archlinux"],
    ["`ci-docker-centos`", "Uses Docker to test multiple versions of CentOS"],
    ["`ci-docker-debian`", "Uses Docker to test multiple versions of Debian"],
    [
      "`ci-docker-debian-snap`",
      "Uses Docker to test Debian just like `ci-docker-debian` except it excludes versions that cannot install snap packages"
    ],
    ["`ci-docker-fedora`", "Uses Docker to test multiple versions of Fedora"],
    ["`ci-docker-ubuntu`", "Uses Docker to test multiple versions of Ubuntu"]
  ]
}
